console.log(`
    1. Сортировка пузырьком: Проходит по списку множество раз, сравнивая и обменивая 
    соседние элементы, пока список не станет отсортированным.
    2. Сортировка выбором: На каждом шаге находит минимальный (или максимальный) элемент 
    в неотсортированной части массива и обменивает его с первым (или последним) элементом 
    неотсортированной части.
    3. Сортировка вставками: Поочередно вставляет каждый элемент на своё место в отсортированной 
    части массива.
    4. Быстрая сортировка: Выбирает элемент (опорный), разделяет массив на две части: элементы меньше
    опорного и элементы больше опорного. Рекурсивно применяет алгоритм к обеим частям.
`);
